----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 24, 50, 50]             648
       BatchNorm2d-2           [-1, 24, 50, 50]              48
              ReLU-3           [-1, 24, 50, 50]               0
         MaxPool2d-4           [-1, 24, 25, 25]               0
            Conv2d-5           [-1, 24, 13, 13]             216
       BatchNorm2d-6           [-1, 24, 13, 13]              48
            Conv2d-7          [-1, 122, 13, 13]           2,928
       BatchNorm2d-8          [-1, 122, 13, 13]             244
              ReLU-9          [-1, 122, 13, 13]               0
           Conv2d-10          [-1, 122, 25, 25]           2,928
      BatchNorm2d-11          [-1, 122, 25, 25]             244
             ReLU-12          [-1, 122, 25, 25]               0
           Conv2d-13          [-1, 122, 13, 13]           1,098
      BatchNorm2d-14          [-1, 122, 13, 13]             244
           Conv2d-15          [-1, 122, 13, 13]          14,884
      BatchNorm2d-16          [-1, 122, 13, 13]             244
             ReLU-17          [-1, 122, 13, 13]               0
 InvertedResidual-18          [-1, 244, 13, 13]               0
           Conv2d-19          [-1, 122, 13, 13]          14,884
      BatchNorm2d-20          [-1, 122, 13, 13]             244
             ReLU-21          [-1, 122, 13, 13]               0
           Conv2d-22          [-1, 122, 13, 13]           1,098
      BatchNorm2d-23          [-1, 122, 13, 13]             244
           Conv2d-24          [-1, 122, 13, 13]          14,884
      BatchNorm2d-25          [-1, 122, 13, 13]             244
             ReLU-26          [-1, 122, 13, 13]               0
 InvertedResidual-27          [-1, 244, 13, 13]               0
           Conv2d-28          [-1, 122, 13, 13]          14,884
      BatchNorm2d-29          [-1, 122, 13, 13]             244
             ReLU-30          [-1, 122, 13, 13]               0
           Conv2d-31          [-1, 122, 13, 13]           1,098
      BatchNorm2d-32          [-1, 122, 13, 13]             244
           Conv2d-33          [-1, 122, 13, 13]          14,884
      BatchNorm2d-34          [-1, 122, 13, 13]             244
             ReLU-35          [-1, 122, 13, 13]               0
 InvertedResidual-36          [-1, 244, 13, 13]               0
           Conv2d-37          [-1, 122, 13, 13]          14,884
      BatchNorm2d-38          [-1, 122, 13, 13]             244
             ReLU-39          [-1, 122, 13, 13]               0
           Conv2d-40          [-1, 122, 13, 13]           1,098
      BatchNorm2d-41          [-1, 122, 13, 13]             244
           Conv2d-42          [-1, 122, 13, 13]          14,884
      BatchNorm2d-43          [-1, 122, 13, 13]             244
             ReLU-44          [-1, 122, 13, 13]               0
 InvertedResidual-45          [-1, 244, 13, 13]               0
           Conv2d-46            [-1, 244, 7, 7]           2,196
      BatchNorm2d-47            [-1, 244, 7, 7]             488
           Conv2d-48            [-1, 244, 7, 7]          59,536
      BatchNorm2d-49            [-1, 244, 7, 7]             488
             ReLU-50            [-1, 244, 7, 7]               0
           Conv2d-51          [-1, 244, 13, 13]          59,536
      BatchNorm2d-52          [-1, 244, 13, 13]             488
             ReLU-53          [-1, 244, 13, 13]               0
           Conv2d-54            [-1, 244, 7, 7]           2,196
      BatchNorm2d-55            [-1, 244, 7, 7]             488
           Conv2d-56            [-1, 244, 7, 7]          59,536
      BatchNorm2d-57            [-1, 244, 7, 7]             488
             ReLU-58            [-1, 244, 7, 7]               0
 InvertedResidual-59            [-1, 488, 7, 7]               0
           Conv2d-60            [-1, 244, 7, 7]          59,536
      BatchNorm2d-61            [-1, 244, 7, 7]             488
             ReLU-62            [-1, 244, 7, 7]               0
           Conv2d-63            [-1, 244, 7, 7]           2,196
      BatchNorm2d-64            [-1, 244, 7, 7]             488
           Conv2d-65            [-1, 244, 7, 7]          59,536
      BatchNorm2d-66            [-1, 244, 7, 7]             488
             ReLU-67            [-1, 244, 7, 7]               0
 InvertedResidual-68            [-1, 488, 7, 7]               0
           Conv2d-69            [-1, 244, 7, 7]          59,536
      BatchNorm2d-70            [-1, 244, 7, 7]             488
             ReLU-71            [-1, 244, 7, 7]               0
           Conv2d-72            [-1, 244, 7, 7]           2,196
      BatchNorm2d-73            [-1, 244, 7, 7]             488
           Conv2d-74            [-1, 244, 7, 7]          59,536
      BatchNorm2d-75            [-1, 244, 7, 7]             488
             ReLU-76            [-1, 244, 7, 7]               0
 InvertedResidual-77            [-1, 488, 7, 7]               0
           Conv2d-78            [-1, 244, 7, 7]          59,536
      BatchNorm2d-79            [-1, 244, 7, 7]             488
             ReLU-80            [-1, 244, 7, 7]               0
           Conv2d-81            [-1, 244, 7, 7]           2,196
      BatchNorm2d-82            [-1, 244, 7, 7]             488
           Conv2d-83            [-1, 244, 7, 7]          59,536
      BatchNorm2d-84            [-1, 244, 7, 7]             488
             ReLU-85            [-1, 244, 7, 7]               0
 InvertedResidual-86            [-1, 488, 7, 7]               0
           Conv2d-87            [-1, 244, 7, 7]          59,536
      BatchNorm2d-88            [-1, 244, 7, 7]             488
             ReLU-89            [-1, 244, 7, 7]               0
           Conv2d-90            [-1, 244, 7, 7]           2,196
      BatchNorm2d-91            [-1, 244, 7, 7]             488
           Conv2d-92            [-1, 244, 7, 7]          59,536
      BatchNorm2d-93            [-1, 244, 7, 7]             488
             ReLU-94            [-1, 244, 7, 7]               0
 InvertedResidual-95            [-1, 488, 7, 7]               0
           Conv2d-96            [-1, 244, 7, 7]          59,536
      BatchNorm2d-97            [-1, 244, 7, 7]             488
             ReLU-98            [-1, 244, 7, 7]               0
           Conv2d-99            [-1, 244, 7, 7]           2,196
     BatchNorm2d-100            [-1, 244, 7, 7]             488
          Conv2d-101            [-1, 244, 7, 7]          59,536
     BatchNorm2d-102            [-1, 244, 7, 7]             488
            ReLU-103            [-1, 244, 7, 7]               0
InvertedResidual-104            [-1, 488, 7, 7]               0
          Conv2d-105            [-1, 244, 7, 7]          59,536
     BatchNorm2d-106            [-1, 244, 7, 7]             488
            ReLU-107            [-1, 244, 7, 7]               0
          Conv2d-108            [-1, 244, 7, 7]           2,196
     BatchNorm2d-109            [-1, 244, 7, 7]             488
          Conv2d-110            [-1, 244, 7, 7]          59,536
     BatchNorm2d-111            [-1, 244, 7, 7]             488
            ReLU-112            [-1, 244, 7, 7]               0
InvertedResidual-113            [-1, 488, 7, 7]               0
          Conv2d-114            [-1, 244, 7, 7]          59,536
     BatchNorm2d-115            [-1, 244, 7, 7]             488
            ReLU-116            [-1, 244, 7, 7]               0
          Conv2d-117            [-1, 244, 7, 7]           2,196
     BatchNorm2d-118            [-1, 244, 7, 7]             488
          Conv2d-119            [-1, 244, 7, 7]          59,536
     BatchNorm2d-120            [-1, 244, 7, 7]             488
            ReLU-121            [-1, 244, 7, 7]               0
InvertedResidual-122            [-1, 488, 7, 7]               0
          Conv2d-123            [-1, 488, 4, 4]           4,392
     BatchNorm2d-124            [-1, 488, 4, 4]             976
          Conv2d-125            [-1, 488, 4, 4]         238,144
     BatchNorm2d-126            [-1, 488, 4, 4]             976
            ReLU-127            [-1, 488, 4, 4]               0
          Conv2d-128            [-1, 488, 7, 7]         238,144
     BatchNorm2d-129            [-1, 488, 7, 7]             976
            ReLU-130            [-1, 488, 7, 7]               0
          Conv2d-131            [-1, 488, 4, 4]           4,392
     BatchNorm2d-132            [-1, 488, 4, 4]             976
          Conv2d-133            [-1, 488, 4, 4]         238,144
     BatchNorm2d-134            [-1, 488, 4, 4]             976
            ReLU-135            [-1, 488, 4, 4]               0
InvertedResidual-136            [-1, 976, 4, 4]               0
          Conv2d-137            [-1, 488, 4, 4]         238,144
     BatchNorm2d-138            [-1, 488, 4, 4]             976
            ReLU-139            [-1, 488, 4, 4]               0
          Conv2d-140            [-1, 488, 4, 4]           4,392
     BatchNorm2d-141            [-1, 488, 4, 4]             976
          Conv2d-142            [-1, 488, 4, 4]         238,144
     BatchNorm2d-143            [-1, 488, 4, 4]             976
            ReLU-144            [-1, 488, 4, 4]               0
InvertedResidual-145            [-1, 976, 4, 4]               0
          Conv2d-146            [-1, 488, 4, 4]         238,144
     BatchNorm2d-147            [-1, 488, 4, 4]             976
            ReLU-148            [-1, 488, 4, 4]               0
          Conv2d-149            [-1, 488, 4, 4]           4,392
     BatchNorm2d-150            [-1, 488, 4, 4]             976
          Conv2d-151            [-1, 488, 4, 4]         238,144
     BatchNorm2d-152            [-1, 488, 4, 4]             976
            ReLU-153            [-1, 488, 4, 4]               0
InvertedResidual-154            [-1, 976, 4, 4]               0
          Conv2d-155            [-1, 488, 4, 4]         238,144
     BatchNorm2d-156            [-1, 488, 4, 4]             976
            ReLU-157            [-1, 488, 4, 4]               0
          Conv2d-158            [-1, 488, 4, 4]           4,392
     BatchNorm2d-159            [-1, 488, 4, 4]             976
          Conv2d-160            [-1, 488, 4, 4]         238,144
     BatchNorm2d-161            [-1, 488, 4, 4]             976
            ReLU-162            [-1, 488, 4, 4]               0
InvertedResidual-163            [-1, 976, 4, 4]               0
          Conv2d-164           [-1, 2048, 4, 4]       1,998,848
     BatchNorm2d-165           [-1, 2048, 4, 4]           4,096
            ReLU-166           [-1, 2048, 4, 4]               0
          Linear-167                    [-1, 5]          10,245
================================================================
Total params: 5,355,241
Trainable params: 5,355,241
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.11
Forward/backward pass size (MB): 21.81
Params size (MB): 20.43
Estimated Total Size (MB): 42.35
----------------------------------------------------------------
