----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 32, 50, 50]             864
       BatchNorm2d-2           [-1, 32, 50, 50]              64
              SiLU-3           [-1, 32, 50, 50]               0
            Conv2d-4           [-1, 32, 50, 50]             288
       BatchNorm2d-5           [-1, 32, 50, 50]              64
              SiLU-6           [-1, 32, 50, 50]               0
 AdaptiveAvgPool2d-7             [-1, 32, 1, 1]               0
            Conv2d-8              [-1, 8, 1, 1]             264
              SiLU-9              [-1, 8, 1, 1]               0
           Conv2d-10             [-1, 32, 1, 1]             288
          Sigmoid-11             [-1, 32, 1, 1]               0
SqueezeExcitation-12           [-1, 32, 50, 50]               0
           Conv2d-13           [-1, 16, 50, 50]             512
      BatchNorm2d-14           [-1, 16, 50, 50]              32
           MBConv-15           [-1, 16, 50, 50]               0
           Conv2d-16           [-1, 16, 50, 50]             144
      BatchNorm2d-17           [-1, 16, 50, 50]              32
             SiLU-18           [-1, 16, 50, 50]               0
AdaptiveAvgPool2d-19             [-1, 16, 1, 1]               0
           Conv2d-20              [-1, 4, 1, 1]              68
             SiLU-21              [-1, 4, 1, 1]               0
           Conv2d-22             [-1, 16, 1, 1]              80
          Sigmoid-23             [-1, 16, 1, 1]               0
SqueezeExcitation-24           [-1, 16, 50, 50]               0
           Conv2d-25           [-1, 16, 50, 50]             256
      BatchNorm2d-26           [-1, 16, 50, 50]              32
  StochasticDepth-27           [-1, 16, 50, 50]               0
           MBConv-28           [-1, 16, 50, 50]               0
           Conv2d-29           [-1, 96, 50, 50]           1,536
      BatchNorm2d-30           [-1, 96, 50, 50]             192
             SiLU-31           [-1, 96, 50, 50]               0
           Conv2d-32           [-1, 96, 25, 25]             864
      BatchNorm2d-33           [-1, 96, 25, 25]             192
             SiLU-34           [-1, 96, 25, 25]               0
AdaptiveAvgPool2d-35             [-1, 96, 1, 1]               0
           Conv2d-36              [-1, 4, 1, 1]             388
             SiLU-37              [-1, 4, 1, 1]               0
           Conv2d-38             [-1, 96, 1, 1]             480
          Sigmoid-39             [-1, 96, 1, 1]               0
SqueezeExcitation-40           [-1, 96, 25, 25]               0
           Conv2d-41           [-1, 24, 25, 25]           2,304
      BatchNorm2d-42           [-1, 24, 25, 25]              48
           MBConv-43           [-1, 24, 25, 25]               0
           Conv2d-44          [-1, 144, 25, 25]           3,456
      BatchNorm2d-45          [-1, 144, 25, 25]             288
             SiLU-46          [-1, 144, 25, 25]               0
           Conv2d-47          [-1, 144, 25, 25]           1,296
      BatchNorm2d-48          [-1, 144, 25, 25]             288
             SiLU-49          [-1, 144, 25, 25]               0
AdaptiveAvgPool2d-50            [-1, 144, 1, 1]               0
           Conv2d-51              [-1, 6, 1, 1]             870
             SiLU-52              [-1, 6, 1, 1]               0
           Conv2d-53            [-1, 144, 1, 1]           1,008
          Sigmoid-54            [-1, 144, 1, 1]               0
SqueezeExcitation-55          [-1, 144, 25, 25]               0
           Conv2d-56           [-1, 24, 25, 25]           3,456
      BatchNorm2d-57           [-1, 24, 25, 25]              48
  StochasticDepth-58           [-1, 24, 25, 25]               0
           MBConv-59           [-1, 24, 25, 25]               0
           Conv2d-60          [-1, 144, 25, 25]           3,456
      BatchNorm2d-61          [-1, 144, 25, 25]             288
             SiLU-62          [-1, 144, 25, 25]               0
           Conv2d-63          [-1, 144, 25, 25]           1,296
      BatchNorm2d-64          [-1, 144, 25, 25]             288
             SiLU-65          [-1, 144, 25, 25]               0
AdaptiveAvgPool2d-66            [-1, 144, 1, 1]               0
           Conv2d-67              [-1, 6, 1, 1]             870
             SiLU-68              [-1, 6, 1, 1]               0
           Conv2d-69            [-1, 144, 1, 1]           1,008
          Sigmoid-70            [-1, 144, 1, 1]               0
SqueezeExcitation-71          [-1, 144, 25, 25]               0
           Conv2d-72           [-1, 24, 25, 25]           3,456
      BatchNorm2d-73           [-1, 24, 25, 25]              48
  StochasticDepth-74           [-1, 24, 25, 25]               0
           MBConv-75           [-1, 24, 25, 25]               0
           Conv2d-76          [-1, 144, 25, 25]           3,456
      BatchNorm2d-77          [-1, 144, 25, 25]             288
             SiLU-78          [-1, 144, 25, 25]               0
           Conv2d-79          [-1, 144, 13, 13]           3,600
      BatchNorm2d-80          [-1, 144, 13, 13]             288
             SiLU-81          [-1, 144, 13, 13]               0
AdaptiveAvgPool2d-82            [-1, 144, 1, 1]               0
           Conv2d-83              [-1, 6, 1, 1]             870
             SiLU-84              [-1, 6, 1, 1]               0
           Conv2d-85            [-1, 144, 1, 1]           1,008
          Sigmoid-86            [-1, 144, 1, 1]               0
SqueezeExcitation-87          [-1, 144, 13, 13]               0
           Conv2d-88           [-1, 40, 13, 13]           5,760
      BatchNorm2d-89           [-1, 40, 13, 13]              80
           MBConv-90           [-1, 40, 13, 13]               0
           Conv2d-91          [-1, 240, 13, 13]           9,600
      BatchNorm2d-92          [-1, 240, 13, 13]             480
             SiLU-93          [-1, 240, 13, 13]               0
           Conv2d-94          [-1, 240, 13, 13]           6,000
      BatchNorm2d-95          [-1, 240, 13, 13]             480
             SiLU-96          [-1, 240, 13, 13]               0
AdaptiveAvgPool2d-97            [-1, 240, 1, 1]               0
           Conv2d-98             [-1, 10, 1, 1]           2,410
             SiLU-99             [-1, 10, 1, 1]               0
          Conv2d-100            [-1, 240, 1, 1]           2,640
         Sigmoid-101            [-1, 240, 1, 1]               0
SqueezeExcitation-102          [-1, 240, 13, 13]               0
          Conv2d-103           [-1, 40, 13, 13]           9,600
     BatchNorm2d-104           [-1, 40, 13, 13]              80
 StochasticDepth-105           [-1, 40, 13, 13]               0
          MBConv-106           [-1, 40, 13, 13]               0
          Conv2d-107          [-1, 240, 13, 13]           9,600
     BatchNorm2d-108          [-1, 240, 13, 13]             480
            SiLU-109          [-1, 240, 13, 13]               0
          Conv2d-110          [-1, 240, 13, 13]           6,000
     BatchNorm2d-111          [-1, 240, 13, 13]             480
            SiLU-112          [-1, 240, 13, 13]               0
AdaptiveAvgPool2d-113            [-1, 240, 1, 1]               0
          Conv2d-114             [-1, 10, 1, 1]           2,410
            SiLU-115             [-1, 10, 1, 1]               0
          Conv2d-116            [-1, 240, 1, 1]           2,640
         Sigmoid-117            [-1, 240, 1, 1]               0
SqueezeExcitation-118          [-1, 240, 13, 13]               0
          Conv2d-119           [-1, 40, 13, 13]           9,600
     BatchNorm2d-120           [-1, 40, 13, 13]              80
 StochasticDepth-121           [-1, 40, 13, 13]               0
          MBConv-122           [-1, 40, 13, 13]               0
          Conv2d-123          [-1, 240, 13, 13]           9,600
     BatchNorm2d-124          [-1, 240, 13, 13]             480
            SiLU-125          [-1, 240, 13, 13]               0
          Conv2d-126            [-1, 240, 7, 7]           2,160
     BatchNorm2d-127            [-1, 240, 7, 7]             480
            SiLU-128            [-1, 240, 7, 7]               0
AdaptiveAvgPool2d-129            [-1, 240, 1, 1]               0
          Conv2d-130             [-1, 10, 1, 1]           2,410
            SiLU-131             [-1, 10, 1, 1]               0
          Conv2d-132            [-1, 240, 1, 1]           2,640
         Sigmoid-133            [-1, 240, 1, 1]               0
SqueezeExcitation-134            [-1, 240, 7, 7]               0
          Conv2d-135             [-1, 80, 7, 7]          19,200
     BatchNorm2d-136             [-1, 80, 7, 7]             160
          MBConv-137             [-1, 80, 7, 7]               0
          Conv2d-138            [-1, 480, 7, 7]          38,400
     BatchNorm2d-139            [-1, 480, 7, 7]             960
            SiLU-140            [-1, 480, 7, 7]               0
          Conv2d-141            [-1, 480, 7, 7]           4,320
     BatchNorm2d-142            [-1, 480, 7, 7]             960
            SiLU-143            [-1, 480, 7, 7]               0
AdaptiveAvgPool2d-144            [-1, 480, 1, 1]               0
          Conv2d-145             [-1, 20, 1, 1]           9,620
            SiLU-146             [-1, 20, 1, 1]               0
          Conv2d-147            [-1, 480, 1, 1]          10,080
         Sigmoid-148            [-1, 480, 1, 1]               0
SqueezeExcitation-149            [-1, 480, 7, 7]               0
          Conv2d-150             [-1, 80, 7, 7]          38,400
     BatchNorm2d-151             [-1, 80, 7, 7]             160
 StochasticDepth-152             [-1, 80, 7, 7]               0
          MBConv-153             [-1, 80, 7, 7]               0
          Conv2d-154            [-1, 480, 7, 7]          38,400
     BatchNorm2d-155            [-1, 480, 7, 7]             960
            SiLU-156            [-1, 480, 7, 7]               0
          Conv2d-157            [-1, 480, 7, 7]           4,320
     BatchNorm2d-158            [-1, 480, 7, 7]             960
            SiLU-159            [-1, 480, 7, 7]               0
AdaptiveAvgPool2d-160            [-1, 480, 1, 1]               0
          Conv2d-161             [-1, 20, 1, 1]           9,620
            SiLU-162             [-1, 20, 1, 1]               0
          Conv2d-163            [-1, 480, 1, 1]          10,080
         Sigmoid-164            [-1, 480, 1, 1]               0
SqueezeExcitation-165            [-1, 480, 7, 7]               0
          Conv2d-166             [-1, 80, 7, 7]          38,400
     BatchNorm2d-167             [-1, 80, 7, 7]             160
 StochasticDepth-168             [-1, 80, 7, 7]               0
          MBConv-169             [-1, 80, 7, 7]               0
          Conv2d-170            [-1, 480, 7, 7]          38,400
     BatchNorm2d-171            [-1, 480, 7, 7]             960
            SiLU-172            [-1, 480, 7, 7]               0
          Conv2d-173            [-1, 480, 7, 7]           4,320
     BatchNorm2d-174            [-1, 480, 7, 7]             960
            SiLU-175            [-1, 480, 7, 7]               0
AdaptiveAvgPool2d-176            [-1, 480, 1, 1]               0
          Conv2d-177             [-1, 20, 1, 1]           9,620
            SiLU-178             [-1, 20, 1, 1]               0
          Conv2d-179            [-1, 480, 1, 1]          10,080
         Sigmoid-180            [-1, 480, 1, 1]               0
SqueezeExcitation-181            [-1, 480, 7, 7]               0
          Conv2d-182             [-1, 80, 7, 7]          38,400
     BatchNorm2d-183             [-1, 80, 7, 7]             160
 StochasticDepth-184             [-1, 80, 7, 7]               0
          MBConv-185             [-1, 80, 7, 7]               0
          Conv2d-186            [-1, 480, 7, 7]          38,400
     BatchNorm2d-187            [-1, 480, 7, 7]             960
            SiLU-188            [-1, 480, 7, 7]               0
          Conv2d-189            [-1, 480, 7, 7]          12,000
     BatchNorm2d-190            [-1, 480, 7, 7]             960
            SiLU-191            [-1, 480, 7, 7]               0
AdaptiveAvgPool2d-192            [-1, 480, 1, 1]               0
          Conv2d-193             [-1, 20, 1, 1]           9,620
            SiLU-194             [-1, 20, 1, 1]               0
          Conv2d-195            [-1, 480, 1, 1]          10,080
         Sigmoid-196            [-1, 480, 1, 1]               0
SqueezeExcitation-197            [-1, 480, 7, 7]               0
          Conv2d-198            [-1, 112, 7, 7]          53,760
     BatchNorm2d-199            [-1, 112, 7, 7]             224
          MBConv-200            [-1, 112, 7, 7]               0
          Conv2d-201            [-1, 672, 7, 7]          75,264
     BatchNorm2d-202            [-1, 672, 7, 7]           1,344
            SiLU-203            [-1, 672, 7, 7]               0
          Conv2d-204            [-1, 672, 7, 7]          16,800
     BatchNorm2d-205            [-1, 672, 7, 7]           1,344
            SiLU-206            [-1, 672, 7, 7]               0
AdaptiveAvgPool2d-207            [-1, 672, 1, 1]               0
          Conv2d-208             [-1, 28, 1, 1]          18,844
            SiLU-209             [-1, 28, 1, 1]               0
          Conv2d-210            [-1, 672, 1, 1]          19,488
         Sigmoid-211            [-1, 672, 1, 1]               0
SqueezeExcitation-212            [-1, 672, 7, 7]               0
          Conv2d-213            [-1, 112, 7, 7]          75,264
     BatchNorm2d-214            [-1, 112, 7, 7]             224
 StochasticDepth-215            [-1, 112, 7, 7]               0
          MBConv-216            [-1, 112, 7, 7]               0
          Conv2d-217            [-1, 672, 7, 7]          75,264
     BatchNorm2d-218            [-1, 672, 7, 7]           1,344
            SiLU-219            [-1, 672, 7, 7]               0
          Conv2d-220            [-1, 672, 7, 7]          16,800
     BatchNorm2d-221            [-1, 672, 7, 7]           1,344
            SiLU-222            [-1, 672, 7, 7]               0
AdaptiveAvgPool2d-223            [-1, 672, 1, 1]               0
          Conv2d-224             [-1, 28, 1, 1]          18,844
            SiLU-225             [-1, 28, 1, 1]               0
          Conv2d-226            [-1, 672, 1, 1]          19,488
         Sigmoid-227            [-1, 672, 1, 1]               0
SqueezeExcitation-228            [-1, 672, 7, 7]               0
          Conv2d-229            [-1, 112, 7, 7]          75,264
     BatchNorm2d-230            [-1, 112, 7, 7]             224
 StochasticDepth-231            [-1, 112, 7, 7]               0
          MBConv-232            [-1, 112, 7, 7]               0
          Conv2d-233            [-1, 672, 7, 7]          75,264
     BatchNorm2d-234            [-1, 672, 7, 7]           1,344
            SiLU-235            [-1, 672, 7, 7]               0
          Conv2d-236            [-1, 672, 7, 7]          16,800
     BatchNorm2d-237            [-1, 672, 7, 7]           1,344
            SiLU-238            [-1, 672, 7, 7]               0
AdaptiveAvgPool2d-239            [-1, 672, 1, 1]               0
          Conv2d-240             [-1, 28, 1, 1]          18,844
            SiLU-241             [-1, 28, 1, 1]               0
          Conv2d-242            [-1, 672, 1, 1]          19,488
         Sigmoid-243            [-1, 672, 1, 1]               0
SqueezeExcitation-244            [-1, 672, 7, 7]               0
          Conv2d-245            [-1, 112, 7, 7]          75,264
     BatchNorm2d-246            [-1, 112, 7, 7]             224
 StochasticDepth-247            [-1, 112, 7, 7]               0
          MBConv-248            [-1, 112, 7, 7]               0
          Conv2d-249            [-1, 672, 7, 7]          75,264
     BatchNorm2d-250            [-1, 672, 7, 7]           1,344
            SiLU-251            [-1, 672, 7, 7]               0
          Conv2d-252            [-1, 672, 4, 4]          16,800
     BatchNorm2d-253            [-1, 672, 4, 4]           1,344
            SiLU-254            [-1, 672, 4, 4]               0
AdaptiveAvgPool2d-255            [-1, 672, 1, 1]               0
          Conv2d-256             [-1, 28, 1, 1]          18,844
            SiLU-257             [-1, 28, 1, 1]               0
          Conv2d-258            [-1, 672, 1, 1]          19,488
         Sigmoid-259            [-1, 672, 1, 1]               0
SqueezeExcitation-260            [-1, 672, 4, 4]               0
          Conv2d-261            [-1, 192, 4, 4]         129,024
     BatchNorm2d-262            [-1, 192, 4, 4]             384
          MBConv-263            [-1, 192, 4, 4]               0
          Conv2d-264           [-1, 1152, 4, 4]         221,184
     BatchNorm2d-265           [-1, 1152, 4, 4]           2,304
            SiLU-266           [-1, 1152, 4, 4]               0
          Conv2d-267           [-1, 1152, 4, 4]          28,800
     BatchNorm2d-268           [-1, 1152, 4, 4]           2,304
            SiLU-269           [-1, 1152, 4, 4]               0
AdaptiveAvgPool2d-270           [-1, 1152, 1, 1]               0
          Conv2d-271             [-1, 48, 1, 1]          55,344
            SiLU-272             [-1, 48, 1, 1]               0
          Conv2d-273           [-1, 1152, 1, 1]          56,448
         Sigmoid-274           [-1, 1152, 1, 1]               0
SqueezeExcitation-275           [-1, 1152, 4, 4]               0
          Conv2d-276            [-1, 192, 4, 4]         221,184
     BatchNorm2d-277            [-1, 192, 4, 4]             384
 StochasticDepth-278            [-1, 192, 4, 4]               0
          MBConv-279            [-1, 192, 4, 4]               0
          Conv2d-280           [-1, 1152, 4, 4]         221,184
     BatchNorm2d-281           [-1, 1152, 4, 4]           2,304
            SiLU-282           [-1, 1152, 4, 4]               0
          Conv2d-283           [-1, 1152, 4, 4]          28,800
     BatchNorm2d-284           [-1, 1152, 4, 4]           2,304
            SiLU-285           [-1, 1152, 4, 4]               0
AdaptiveAvgPool2d-286           [-1, 1152, 1, 1]               0
          Conv2d-287             [-1, 48, 1, 1]          55,344
            SiLU-288             [-1, 48, 1, 1]               0
          Conv2d-289           [-1, 1152, 1, 1]          56,448
         Sigmoid-290           [-1, 1152, 1, 1]               0
SqueezeExcitation-291           [-1, 1152, 4, 4]               0
          Conv2d-292            [-1, 192, 4, 4]         221,184
     BatchNorm2d-293            [-1, 192, 4, 4]             384
 StochasticDepth-294            [-1, 192, 4, 4]               0
          MBConv-295            [-1, 192, 4, 4]               0
          Conv2d-296           [-1, 1152, 4, 4]         221,184
     BatchNorm2d-297           [-1, 1152, 4, 4]           2,304
            SiLU-298           [-1, 1152, 4, 4]               0
          Conv2d-299           [-1, 1152, 4, 4]          28,800
     BatchNorm2d-300           [-1, 1152, 4, 4]           2,304
            SiLU-301           [-1, 1152, 4, 4]               0
AdaptiveAvgPool2d-302           [-1, 1152, 1, 1]               0
          Conv2d-303             [-1, 48, 1, 1]          55,344
            SiLU-304             [-1, 48, 1, 1]               0
          Conv2d-305           [-1, 1152, 1, 1]          56,448
         Sigmoid-306           [-1, 1152, 1, 1]               0
SqueezeExcitation-307           [-1, 1152, 4, 4]               0
          Conv2d-308            [-1, 192, 4, 4]         221,184
     BatchNorm2d-309            [-1, 192, 4, 4]             384
 StochasticDepth-310            [-1, 192, 4, 4]               0
          MBConv-311            [-1, 192, 4, 4]               0
          Conv2d-312           [-1, 1152, 4, 4]         221,184
     BatchNorm2d-313           [-1, 1152, 4, 4]           2,304
            SiLU-314           [-1, 1152, 4, 4]               0
          Conv2d-315           [-1, 1152, 4, 4]          28,800
     BatchNorm2d-316           [-1, 1152, 4, 4]           2,304
            SiLU-317           [-1, 1152, 4, 4]               0
AdaptiveAvgPool2d-318           [-1, 1152, 1, 1]               0
          Conv2d-319             [-1, 48, 1, 1]          55,344
            SiLU-320             [-1, 48, 1, 1]               0
          Conv2d-321           [-1, 1152, 1, 1]          56,448
         Sigmoid-322           [-1, 1152, 1, 1]               0
SqueezeExcitation-323           [-1, 1152, 4, 4]               0
          Conv2d-324            [-1, 192, 4, 4]         221,184
     BatchNorm2d-325            [-1, 192, 4, 4]             384
 StochasticDepth-326            [-1, 192, 4, 4]               0
          MBConv-327            [-1, 192, 4, 4]               0
          Conv2d-328           [-1, 1152, 4, 4]         221,184
     BatchNorm2d-329           [-1, 1152, 4, 4]           2,304
            SiLU-330           [-1, 1152, 4, 4]               0
          Conv2d-331           [-1, 1152, 4, 4]          10,368
     BatchNorm2d-332           [-1, 1152, 4, 4]           2,304
            SiLU-333           [-1, 1152, 4, 4]               0
AdaptiveAvgPool2d-334           [-1, 1152, 1, 1]               0
          Conv2d-335             [-1, 48, 1, 1]          55,344
            SiLU-336             [-1, 48, 1, 1]               0
          Conv2d-337           [-1, 1152, 1, 1]          56,448
         Sigmoid-338           [-1, 1152, 1, 1]               0
SqueezeExcitation-339           [-1, 1152, 4, 4]               0
          Conv2d-340            [-1, 320, 4, 4]         368,640
     BatchNorm2d-341            [-1, 320, 4, 4]             640
          MBConv-342            [-1, 320, 4, 4]               0
          Conv2d-343           [-1, 1920, 4, 4]         614,400
     BatchNorm2d-344           [-1, 1920, 4, 4]           3,840
            SiLU-345           [-1, 1920, 4, 4]               0
          Conv2d-346           [-1, 1920, 4, 4]          17,280
     BatchNorm2d-347           [-1, 1920, 4, 4]           3,840
            SiLU-348           [-1, 1920, 4, 4]               0
AdaptiveAvgPool2d-349           [-1, 1920, 1, 1]               0
          Conv2d-350             [-1, 80, 1, 1]         153,680
            SiLU-351             [-1, 80, 1, 1]               0
          Conv2d-352           [-1, 1920, 1, 1]         155,520
         Sigmoid-353           [-1, 1920, 1, 1]               0
SqueezeExcitation-354           [-1, 1920, 4, 4]               0
          Conv2d-355            [-1, 320, 4, 4]         614,400
     BatchNorm2d-356            [-1, 320, 4, 4]             640
 StochasticDepth-357            [-1, 320, 4, 4]               0
          MBConv-358            [-1, 320, 4, 4]               0
          Conv2d-359           [-1, 1280, 4, 4]         409,600
     BatchNorm2d-360           [-1, 1280, 4, 4]           2,560
            SiLU-361           [-1, 1280, 4, 4]               0
AdaptiveAvgPool2d-362           [-1, 1280, 1, 1]               0
         Dropout-363                 [-1, 1280]               0
          Linear-364                    [-1, 5]           6,405
================================================================
Total params: 6,519,589
Trainable params: 6,519,589
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.11
Forward/backward pass size (MB): 55.36
Params size (MB): 24.87
Estimated Total Size (MB): 80.35
----------------------------------------------------------------
