----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 100, 100]           1,792
              ReLU-2         [-1, 64, 100, 100]               0
            Conv2d-3         [-1, 64, 100, 100]          36,928
              ReLU-4         [-1, 64, 100, 100]               0
         MaxPool2d-5           [-1, 64, 50, 50]               0
            Conv2d-6          [-1, 128, 50, 50]          73,856
              ReLU-7          [-1, 128, 50, 50]               0
            Conv2d-8          [-1, 128, 50, 50]         147,584
              ReLU-9          [-1, 128, 50, 50]               0
        MaxPool2d-10          [-1, 128, 25, 25]               0
           Conv2d-11          [-1, 256, 25, 25]         295,168
             ReLU-12          [-1, 256, 25, 25]               0
           Conv2d-13          [-1, 256, 25, 25]         590,080
             ReLU-14          [-1, 256, 25, 25]               0
           Conv2d-15          [-1, 256, 25, 25]         590,080
             ReLU-16          [-1, 256, 25, 25]               0
           Conv2d-17          [-1, 256, 25, 25]         590,080
             ReLU-18          [-1, 256, 25, 25]               0
        MaxPool2d-19          [-1, 256, 12, 12]               0
           Conv2d-20          [-1, 512, 12, 12]       1,180,160
             ReLU-21          [-1, 512, 12, 12]               0
           Conv2d-22          [-1, 512, 12, 12]       2,359,808
             ReLU-23          [-1, 512, 12, 12]               0
           Conv2d-24          [-1, 512, 12, 12]       2,359,808
             ReLU-25          [-1, 512, 12, 12]               0
           Conv2d-26          [-1, 512, 12, 12]       2,359,808
             ReLU-27          [-1, 512, 12, 12]               0
        MaxPool2d-28            [-1, 512, 6, 6]               0
           Conv2d-29            [-1, 512, 6, 6]       2,359,808
             ReLU-30            [-1, 512, 6, 6]               0
           Conv2d-31            [-1, 512, 6, 6]       2,359,808
             ReLU-32            [-1, 512, 6, 6]               0
           Conv2d-33            [-1, 512, 6, 6]       2,359,808
             ReLU-34            [-1, 512, 6, 6]               0
           Conv2d-35            [-1, 512, 6, 6]       2,359,808
             ReLU-36            [-1, 512, 6, 6]               0
        MaxPool2d-37            [-1, 512, 3, 3]               0
AdaptiveAvgPool2d-38            [-1, 512, 7, 7]               0
           Linear-39                 [-1, 4096]     102,764,544
             ReLU-40                 [-1, 4096]               0
          Dropout-41                 [-1, 4096]               0
           Linear-42                 [-1, 4096]      16,781,312
             ReLU-43                 [-1, 4096]               0
          Dropout-44                 [-1, 4096]               0
           Linear-45                    [-1, 5]          20,485
================================================================
Total params: 139,590,725
Trainable params: 139,590,725
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.11
Forward/backward pass size (MB): 47.35
Params size (MB): 532.50
Estimated Total Size (MB): 579.97
----------------------------------------------------------------
