----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 100, 100]           1,792
              ReLU-2         [-1, 64, 100, 100]               0
         MaxPool2d-3           [-1, 64, 50, 50]               0
            Conv2d-4          [-1, 128, 50, 50]          73,856
              ReLU-5          [-1, 128, 50, 50]               0
         MaxPool2d-6          [-1, 128, 25, 25]               0
            Conv2d-7          [-1, 256, 25, 25]         295,168
              ReLU-8          [-1, 256, 25, 25]               0
            Conv2d-9          [-1, 256, 25, 25]         590,080
             ReLU-10          [-1, 256, 25, 25]               0
        MaxPool2d-11          [-1, 256, 12, 12]               0
           Conv2d-12          [-1, 512, 12, 12]       1,180,160
             ReLU-13          [-1, 512, 12, 12]               0
           Conv2d-14          [-1, 512, 12, 12]       2,359,808
             ReLU-15          [-1, 512, 12, 12]               0
        MaxPool2d-16            [-1, 512, 6, 6]               0
           Conv2d-17            [-1, 512, 6, 6]       2,359,808
             ReLU-18            [-1, 512, 6, 6]               0
           Conv2d-19            [-1, 512, 6, 6]       2,359,808
             ReLU-20            [-1, 512, 6, 6]               0
        MaxPool2d-21            [-1, 512, 3, 3]               0
AdaptiveAvgPool2d-22            [-1, 512, 7, 7]               0
           Linear-23                 [-1, 4096]     102,764,544
             ReLU-24                 [-1, 4096]               0
          Dropout-25                 [-1, 4096]               0
           Linear-26                 [-1, 4096]      16,781,312
             ReLU-27                 [-1, 4096]               0
          Dropout-28                 [-1, 4096]               0
           Linear-29                    [-1, 5]          20,485
================================================================
Total params: 128,786,821
Trainable params: 128,786,821
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.11
Forward/backward pass size (MB): 25.01
Params size (MB): 491.28
Estimated Total Size (MB): 516.41
----------------------------------------------------------------
