----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 16, 50, 50]             432
       BatchNorm2d-2           [-1, 16, 50, 50]              32
         Hardswish-3           [-1, 16, 50, 50]               0
            Conv2d-4           [-1, 16, 50, 50]             144
       BatchNorm2d-5           [-1, 16, 50, 50]              32
              ReLU-6           [-1, 16, 50, 50]               0
            Conv2d-7           [-1, 16, 50, 50]             256
       BatchNorm2d-8           [-1, 16, 50, 50]              32
  InvertedResidual-9           [-1, 16, 50, 50]               0
           Conv2d-10           [-1, 64, 50, 50]           1,024
      BatchNorm2d-11           [-1, 64, 50, 50]             128
             ReLU-12           [-1, 64, 50, 50]               0
           Conv2d-13           [-1, 64, 25, 25]             576
      BatchNorm2d-14           [-1, 64, 25, 25]             128
             ReLU-15           [-1, 64, 25, 25]               0
           Conv2d-16           [-1, 24, 25, 25]           1,536
      BatchNorm2d-17           [-1, 24, 25, 25]              48
 InvertedResidual-18           [-1, 24, 25, 25]               0
           Conv2d-19           [-1, 72, 25, 25]           1,728
      BatchNorm2d-20           [-1, 72, 25, 25]             144
             ReLU-21           [-1, 72, 25, 25]               0
           Conv2d-22           [-1, 72, 25, 25]             648
      BatchNorm2d-23           [-1, 72, 25, 25]             144
             ReLU-24           [-1, 72, 25, 25]               0
           Conv2d-25           [-1, 24, 25, 25]           1,728
      BatchNorm2d-26           [-1, 24, 25, 25]              48
 InvertedResidual-27           [-1, 24, 25, 25]               0
           Conv2d-28           [-1, 72, 25, 25]           1,728
      BatchNorm2d-29           [-1, 72, 25, 25]             144
             ReLU-30           [-1, 72, 25, 25]               0
           Conv2d-31           [-1, 72, 13, 13]           1,800
      BatchNorm2d-32           [-1, 72, 13, 13]             144
             ReLU-33           [-1, 72, 13, 13]               0
AdaptiveAvgPool2d-34             [-1, 72, 1, 1]               0
           Conv2d-35             [-1, 24, 1, 1]           1,752
             ReLU-36             [-1, 24, 1, 1]               0
           Conv2d-37             [-1, 72, 1, 1]           1,800
      Hardsigmoid-38             [-1, 72, 1, 1]               0
SqueezeExcitation-39           [-1, 72, 13, 13]               0
           Conv2d-40           [-1, 40, 13, 13]           2,880
      BatchNorm2d-41           [-1, 40, 13, 13]              80
 InvertedResidual-42           [-1, 40, 13, 13]               0
           Conv2d-43          [-1, 120, 13, 13]           4,800
      BatchNorm2d-44          [-1, 120, 13, 13]             240
             ReLU-45          [-1, 120, 13, 13]               0
           Conv2d-46          [-1, 120, 13, 13]           3,000
      BatchNorm2d-47          [-1, 120, 13, 13]             240
             ReLU-48          [-1, 120, 13, 13]               0
AdaptiveAvgPool2d-49            [-1, 120, 1, 1]               0
           Conv2d-50             [-1, 32, 1, 1]           3,872
             ReLU-51             [-1, 32, 1, 1]               0
           Conv2d-52            [-1, 120, 1, 1]           3,960
      Hardsigmoid-53            [-1, 120, 1, 1]               0
SqueezeExcitation-54          [-1, 120, 13, 13]               0
           Conv2d-55           [-1, 40, 13, 13]           4,800
      BatchNorm2d-56           [-1, 40, 13, 13]              80
 InvertedResidual-57           [-1, 40, 13, 13]               0
           Conv2d-58          [-1, 120, 13, 13]           4,800
      BatchNorm2d-59          [-1, 120, 13, 13]             240
             ReLU-60          [-1, 120, 13, 13]               0
           Conv2d-61          [-1, 120, 13, 13]           3,000
      BatchNorm2d-62          [-1, 120, 13, 13]             240
             ReLU-63          [-1, 120, 13, 13]               0
AdaptiveAvgPool2d-64            [-1, 120, 1, 1]               0
           Conv2d-65             [-1, 32, 1, 1]           3,872
             ReLU-66             [-1, 32, 1, 1]               0
           Conv2d-67            [-1, 120, 1, 1]           3,960
      Hardsigmoid-68            [-1, 120, 1, 1]               0
SqueezeExcitation-69          [-1, 120, 13, 13]               0
           Conv2d-70           [-1, 40, 13, 13]           4,800
      BatchNorm2d-71           [-1, 40, 13, 13]              80
 InvertedResidual-72           [-1, 40, 13, 13]               0
           Conv2d-73          [-1, 240, 13, 13]           9,600
      BatchNorm2d-74          [-1, 240, 13, 13]             480
        Hardswish-75          [-1, 240, 13, 13]               0
           Conv2d-76            [-1, 240, 7, 7]           2,160
      BatchNorm2d-77            [-1, 240, 7, 7]             480
        Hardswish-78            [-1, 240, 7, 7]               0
           Conv2d-79             [-1, 80, 7, 7]          19,200
      BatchNorm2d-80             [-1, 80, 7, 7]             160
 InvertedResidual-81             [-1, 80, 7, 7]               0
           Conv2d-82            [-1, 200, 7, 7]          16,000
      BatchNorm2d-83            [-1, 200, 7, 7]             400
        Hardswish-84            [-1, 200, 7, 7]               0
           Conv2d-85            [-1, 200, 7, 7]           1,800
      BatchNorm2d-86            [-1, 200, 7, 7]             400
        Hardswish-87            [-1, 200, 7, 7]               0
           Conv2d-88             [-1, 80, 7, 7]          16,000
      BatchNorm2d-89             [-1, 80, 7, 7]             160
 InvertedResidual-90             [-1, 80, 7, 7]               0
           Conv2d-91            [-1, 184, 7, 7]          14,720
      BatchNorm2d-92            [-1, 184, 7, 7]             368
        Hardswish-93            [-1, 184, 7, 7]               0
           Conv2d-94            [-1, 184, 7, 7]           1,656
      BatchNorm2d-95            [-1, 184, 7, 7]             368
        Hardswish-96            [-1, 184, 7, 7]               0
           Conv2d-97             [-1, 80, 7, 7]          14,720
      BatchNorm2d-98             [-1, 80, 7, 7]             160
 InvertedResidual-99             [-1, 80, 7, 7]               0
          Conv2d-100            [-1, 184, 7, 7]          14,720
     BatchNorm2d-101            [-1, 184, 7, 7]             368
       Hardswish-102            [-1, 184, 7, 7]               0
          Conv2d-103            [-1, 184, 7, 7]           1,656
     BatchNorm2d-104            [-1, 184, 7, 7]             368
       Hardswish-105            [-1, 184, 7, 7]               0
          Conv2d-106             [-1, 80, 7, 7]          14,720
     BatchNorm2d-107             [-1, 80, 7, 7]             160
InvertedResidual-108             [-1, 80, 7, 7]               0
          Conv2d-109            [-1, 480, 7, 7]          38,400
     BatchNorm2d-110            [-1, 480, 7, 7]             960
       Hardswish-111            [-1, 480, 7, 7]               0
          Conv2d-112            [-1, 480, 7, 7]           4,320
     BatchNorm2d-113            [-1, 480, 7, 7]             960
       Hardswish-114            [-1, 480, 7, 7]               0
AdaptiveAvgPool2d-115            [-1, 480, 1, 1]               0
          Conv2d-116            [-1, 120, 1, 1]          57,720
            ReLU-117            [-1, 120, 1, 1]               0
          Conv2d-118            [-1, 480, 1, 1]          58,080
     Hardsigmoid-119            [-1, 480, 1, 1]               0
SqueezeExcitation-120            [-1, 480, 7, 7]               0
          Conv2d-121            [-1, 112, 7, 7]          53,760
     BatchNorm2d-122            [-1, 112, 7, 7]             224
InvertedResidual-123            [-1, 112, 7, 7]               0
          Conv2d-124            [-1, 672, 7, 7]          75,264
     BatchNorm2d-125            [-1, 672, 7, 7]           1,344
       Hardswish-126            [-1, 672, 7, 7]               0
          Conv2d-127            [-1, 672, 7, 7]           6,048
     BatchNorm2d-128            [-1, 672, 7, 7]           1,344
       Hardswish-129            [-1, 672, 7, 7]               0
AdaptiveAvgPool2d-130            [-1, 672, 1, 1]               0
          Conv2d-131            [-1, 168, 1, 1]         113,064
            ReLU-132            [-1, 168, 1, 1]               0
          Conv2d-133            [-1, 672, 1, 1]         113,568
     Hardsigmoid-134            [-1, 672, 1, 1]               0
SqueezeExcitation-135            [-1, 672, 7, 7]               0
          Conv2d-136            [-1, 112, 7, 7]          75,264
     BatchNorm2d-137            [-1, 112, 7, 7]             224
InvertedResidual-138            [-1, 112, 7, 7]               0
          Conv2d-139            [-1, 672, 7, 7]          75,264
     BatchNorm2d-140            [-1, 672, 7, 7]           1,344
       Hardswish-141            [-1, 672, 7, 7]               0
          Conv2d-142            [-1, 672, 4, 4]          16,800
     BatchNorm2d-143            [-1, 672, 4, 4]           1,344
       Hardswish-144            [-1, 672, 4, 4]               0
AdaptiveAvgPool2d-145            [-1, 672, 1, 1]               0
          Conv2d-146            [-1, 168, 1, 1]         113,064
            ReLU-147            [-1, 168, 1, 1]               0
          Conv2d-148            [-1, 672, 1, 1]         113,568
     Hardsigmoid-149            [-1, 672, 1, 1]               0
SqueezeExcitation-150            [-1, 672, 4, 4]               0
          Conv2d-151            [-1, 160, 4, 4]         107,520
     BatchNorm2d-152            [-1, 160, 4, 4]             320
InvertedResidual-153            [-1, 160, 4, 4]               0
          Conv2d-154            [-1, 960, 4, 4]         153,600
     BatchNorm2d-155            [-1, 960, 4, 4]           1,920
       Hardswish-156            [-1, 960, 4, 4]               0
          Conv2d-157            [-1, 960, 4, 4]          24,000
     BatchNorm2d-158            [-1, 960, 4, 4]           1,920
       Hardswish-159            [-1, 960, 4, 4]               0
AdaptiveAvgPool2d-160            [-1, 960, 1, 1]               0
          Conv2d-161            [-1, 240, 1, 1]         230,640
            ReLU-162            [-1, 240, 1, 1]               0
          Conv2d-163            [-1, 960, 1, 1]         231,360
     Hardsigmoid-164            [-1, 960, 1, 1]               0
SqueezeExcitation-165            [-1, 960, 4, 4]               0
          Conv2d-166            [-1, 160, 4, 4]         153,600
     BatchNorm2d-167            [-1, 160, 4, 4]             320
InvertedResidual-168            [-1, 160, 4, 4]               0
          Conv2d-169            [-1, 960, 4, 4]         153,600
     BatchNorm2d-170            [-1, 960, 4, 4]           1,920
       Hardswish-171            [-1, 960, 4, 4]               0
          Conv2d-172            [-1, 960, 4, 4]          24,000
     BatchNorm2d-173            [-1, 960, 4, 4]           1,920
       Hardswish-174            [-1, 960, 4, 4]               0
AdaptiveAvgPool2d-175            [-1, 960, 1, 1]               0
          Conv2d-176            [-1, 240, 1, 1]         230,640
            ReLU-177            [-1, 240, 1, 1]               0
          Conv2d-178            [-1, 960, 1, 1]         231,360
     Hardsigmoid-179            [-1, 960, 1, 1]               0
SqueezeExcitation-180            [-1, 960, 4, 4]               0
          Conv2d-181            [-1, 160, 4, 4]         153,600
     BatchNorm2d-182            [-1, 160, 4, 4]             320
InvertedResidual-183            [-1, 160, 4, 4]               0
          Conv2d-184            [-1, 960, 4, 4]         153,600
     BatchNorm2d-185            [-1, 960, 4, 4]           1,920
       Hardswish-186            [-1, 960, 4, 4]               0
AdaptiveAvgPool2d-187            [-1, 960, 1, 1]               0
          Linear-188                 [-1, 1280]       1,230,080
       Hardswish-189                 [-1, 1280]               0
         Dropout-190                 [-1, 1280]               0
          Linear-191                    [-1, 5]           6,405
================================================================
Total params: 4,208,437
Trainable params: 4,208,437
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.11
Forward/backward pass size (MB): 23.59
Params size (MB): 16.05
Estimated Total Size (MB): 39.76
----------------------------------------------------------------
