----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 49, 49]           1,792
              ReLU-2           [-1, 64, 49, 49]               0
         MaxPool2d-3           [-1, 64, 24, 24]               0
            Conv2d-4           [-1, 16, 24, 24]           1,040
              ReLU-5           [-1, 16, 24, 24]               0
            Conv2d-6           [-1, 64, 24, 24]           1,088
              ReLU-7           [-1, 64, 24, 24]               0
            Conv2d-8           [-1, 64, 24, 24]           9,280
              ReLU-9           [-1, 64, 24, 24]               0
             Fire-10          [-1, 128, 24, 24]               0
           Conv2d-11           [-1, 16, 24, 24]           2,064
             ReLU-12           [-1, 16, 24, 24]               0
           Conv2d-13           [-1, 64, 24, 24]           1,088
             ReLU-14           [-1, 64, 24, 24]               0
           Conv2d-15           [-1, 64, 24, 24]           9,280
             ReLU-16           [-1, 64, 24, 24]               0
             Fire-17          [-1, 128, 24, 24]               0
        MaxPool2d-18          [-1, 128, 12, 12]               0
           Conv2d-19           [-1, 32, 12, 12]           4,128
             ReLU-20           [-1, 32, 12, 12]               0
           Conv2d-21          [-1, 128, 12, 12]           4,224
             ReLU-22          [-1, 128, 12, 12]               0
           Conv2d-23          [-1, 128, 12, 12]          36,992
             ReLU-24          [-1, 128, 12, 12]               0
             Fire-25          [-1, 256, 12, 12]               0
           Conv2d-26           [-1, 32, 12, 12]           8,224
             ReLU-27           [-1, 32, 12, 12]               0
           Conv2d-28          [-1, 128, 12, 12]           4,224
             ReLU-29          [-1, 128, 12, 12]               0
           Conv2d-30          [-1, 128, 12, 12]          36,992
             ReLU-31          [-1, 128, 12, 12]               0
             Fire-32          [-1, 256, 12, 12]               0
        MaxPool2d-33            [-1, 256, 6, 6]               0
           Conv2d-34             [-1, 48, 6, 6]          12,336
             ReLU-35             [-1, 48, 6, 6]               0
           Conv2d-36            [-1, 192, 6, 6]           9,408
             ReLU-37            [-1, 192, 6, 6]               0
           Conv2d-38            [-1, 192, 6, 6]          83,136
             ReLU-39            [-1, 192, 6, 6]               0
             Fire-40            [-1, 384, 6, 6]               0
           Conv2d-41             [-1, 48, 6, 6]          18,480
             ReLU-42             [-1, 48, 6, 6]               0
           Conv2d-43            [-1, 192, 6, 6]           9,408
             ReLU-44            [-1, 192, 6, 6]               0
           Conv2d-45            [-1, 192, 6, 6]          83,136
             ReLU-46            [-1, 192, 6, 6]               0
             Fire-47            [-1, 384, 6, 6]               0
           Conv2d-48             [-1, 64, 6, 6]          24,640
             ReLU-49             [-1, 64, 6, 6]               0
           Conv2d-50            [-1, 256, 6, 6]          16,640
             ReLU-51            [-1, 256, 6, 6]               0
           Conv2d-52            [-1, 256, 6, 6]         147,712
             ReLU-53            [-1, 256, 6, 6]               0
             Fire-54            [-1, 512, 6, 6]               0
           Conv2d-55             [-1, 64, 6, 6]          32,832
             ReLU-56             [-1, 64, 6, 6]               0
           Conv2d-57            [-1, 256, 6, 6]          16,640
             ReLU-58            [-1, 256, 6, 6]               0
           Conv2d-59            [-1, 256, 6, 6]         147,712
             ReLU-60            [-1, 256, 6, 6]               0
             Fire-61            [-1, 512, 6, 6]               0
          Dropout-62            [-1, 512, 6, 6]               0
           Conv2d-63              [-1, 5, 6, 6]           2,565
             ReLU-64              [-1, 5, 6, 6]               0
AdaptiveAvgPool2d-65              [-1, 5, 1, 1]               0
================================================================
Total params: 725,061
Trainable params: 725,061
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.11
Forward/backward pass size (MB): 10.06
Params size (MB): 2.77
Estimated Total Size (MB): 12.94
----------------------------------------------------------------
