----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 50, 50]           9,408
       BatchNorm2d-2           [-1, 64, 50, 50]             128
              ReLU-3           [-1, 64, 50, 50]               0
         MaxPool2d-4           [-1, 64, 25, 25]               0
            Conv2d-5           [-1, 64, 25, 25]          36,864
       BatchNorm2d-6           [-1, 64, 25, 25]             128
              ReLU-7           [-1, 64, 25, 25]               0
            Conv2d-8           [-1, 64, 25, 25]          36,864
       BatchNorm2d-9           [-1, 64, 25, 25]             128
             ReLU-10           [-1, 64, 25, 25]               0
       BasicBlock-11           [-1, 64, 25, 25]               0
           Conv2d-12           [-1, 64, 25, 25]          36,864
      BatchNorm2d-13           [-1, 64, 25, 25]             128
             ReLU-14           [-1, 64, 25, 25]               0
           Conv2d-15           [-1, 64, 25, 25]          36,864
      BatchNorm2d-16           [-1, 64, 25, 25]             128
             ReLU-17           [-1, 64, 25, 25]               0
       BasicBlock-18           [-1, 64, 25, 25]               0
           Conv2d-19          [-1, 128, 13, 13]          73,728
      BatchNorm2d-20          [-1, 128, 13, 13]             256
             ReLU-21          [-1, 128, 13, 13]               0
           Conv2d-22          [-1, 128, 13, 13]         147,456
      BatchNorm2d-23          [-1, 128, 13, 13]             256
           Conv2d-24          [-1, 128, 13, 13]           8,192
      BatchNorm2d-25          [-1, 128, 13, 13]             256
             ReLU-26          [-1, 128, 13, 13]               0
       BasicBlock-27          [-1, 128, 13, 13]               0
           Conv2d-28          [-1, 128, 13, 13]         147,456
      BatchNorm2d-29          [-1, 128, 13, 13]             256
             ReLU-30          [-1, 128, 13, 13]               0
           Conv2d-31          [-1, 128, 13, 13]         147,456
      BatchNorm2d-32          [-1, 128, 13, 13]             256
             ReLU-33          [-1, 128, 13, 13]               0
       BasicBlock-34          [-1, 128, 13, 13]               0
           Conv2d-35            [-1, 256, 7, 7]         294,912
      BatchNorm2d-36            [-1, 256, 7, 7]             512
             ReLU-37            [-1, 256, 7, 7]               0
           Conv2d-38            [-1, 256, 7, 7]         589,824
      BatchNorm2d-39            [-1, 256, 7, 7]             512
           Conv2d-40            [-1, 256, 7, 7]          32,768
      BatchNorm2d-41            [-1, 256, 7, 7]             512
             ReLU-42            [-1, 256, 7, 7]               0
       BasicBlock-43            [-1, 256, 7, 7]               0
           Conv2d-44            [-1, 256, 7, 7]         589,824
      BatchNorm2d-45            [-1, 256, 7, 7]             512
             ReLU-46            [-1, 256, 7, 7]               0
           Conv2d-47            [-1, 256, 7, 7]         589,824
      BatchNorm2d-48            [-1, 256, 7, 7]             512
             ReLU-49            [-1, 256, 7, 7]               0
       BasicBlock-50            [-1, 256, 7, 7]               0
           Conv2d-51            [-1, 512, 4, 4]       1,179,648
      BatchNorm2d-52            [-1, 512, 4, 4]           1,024
             ReLU-53            [-1, 512, 4, 4]               0
           Conv2d-54            [-1, 512, 4, 4]       2,359,296
      BatchNorm2d-55            [-1, 512, 4, 4]           1,024
           Conv2d-56            [-1, 512, 4, 4]         131,072
      BatchNorm2d-57            [-1, 512, 4, 4]           1,024
             ReLU-58            [-1, 512, 4, 4]               0
       BasicBlock-59            [-1, 512, 4, 4]               0
           Conv2d-60            [-1, 512, 4, 4]       2,359,296
      BatchNorm2d-61            [-1, 512, 4, 4]           1,024
             ReLU-62            [-1, 512, 4, 4]               0
           Conv2d-63            [-1, 512, 4, 4]       2,359,296
      BatchNorm2d-64            [-1, 512, 4, 4]           1,024
             ReLU-65            [-1, 512, 4, 4]               0
       BasicBlock-66            [-1, 512, 4, 4]               0
AdaptiveAvgPool2d-67            [-1, 512, 1, 1]               0
           Linear-68                    [-1, 5]           2,565
================================================================
Total params: 11,179,077
Trainable params: 11,179,077
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.11
Forward/backward pass size (MB): 13.42
Params size (MB): 42.64
Estimated Total Size (MB): 56.17
----------------------------------------------------------------
